k6-tests-result/file-upload/preset-thread-pool-4C-4G-raw-streaming-thread-256.txt
  █ THRESHOLDS

    http_req_duration
    ✗ 'p(95)<3000' p(95)=27.36s

    http_req_failed
    ✓ 'rate<0.01' rate=0.11%


  █ TOTAL RESULTS

    checks_total.......................: 6305   19.771881/s
    checks_succeeded...................: 99.88% 6298 out of 6305
    checks_failed......................: 0.11%  7 out of 6305

    ✗ HTTP 200
      ↳  99% — ✓ 6298 / ✗ 7

    HTTP
    http_req_duration.......................................................: avg=9.78s min=0s      med=7.27s max=1m1s p(90)=21.52s p(95)=27.36s
      { expected_response:true }............................................: avg=9.74s min=91.12ms med=7.26s max=1m0s p(90)=21.49s p(95)=27.27s
    http_req_failed.........................................................: 0.11%  7 out of 6305
    http_reqs...............................................................: 6305   19.771881/s

    EXECUTION
    iteration_duration......................................................: avg=9.59s min=91.74ms med=7.2s  max=1m0s p(90)=21.21s p(95)=26.6s
    iterations..............................................................: 6305   19.771881/s
    vus.....................................................................: 1      min=0         max=200
    vus_max.................................................................: 200    min=170       max=200

    NETWORK
    data_received...........................................................: 579 kB 1.8 kB/s
    data_sent...............................................................: 33 GB  104 MB/s



running (5m18.9s), 000/200 VUs, 6305 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  5m0s
time="2025-07-04T11:54:51Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"