k6-tests-result/file-upload/preset-thread-pool.txt
  █ THRESHOLDS

    http_req_duration
    ✗ 'p(95)<3000' p(95)=15.58s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......................: 6592    19.908942/s
    checks_succeeded...................: 100.00% 6592 out of 6592
    checks_failed......................: 0.00%   0 out of 6592

    ✓ HTTP 200

    HTTP
    http_req_duration.......................................................: avg=9.79s min=129.44ms med=9.53s max=29.33s p(90)=14.14s p(95)=15.58s
      { expected_response:true }............................................: avg=9.79s min=129.44ms med=9.53s max=29.33s p(90)=14.14s p(95)=15.58s
    http_req_failed.........................................................: 0.00%  0 out of 6592
    http_reqs...............................................................: 6592   19.908942/s

    EXECUTION
    iteration_duration......................................................: avg=9.17s min=135.31ms med=8.89s max=27.63s p(90)=12.89s p(95)=14.26s
    iterations..............................................................: 6592   19.908942/s
    vus.....................................................................: 21     min=0         max=200
    vus_max.................................................................: 200    min=174       max=200

    NETWORK
    data_received...........................................................: 607 kB 1.8 kB/s
    data_sent...............................................................: 35 GB  104 MB/s



running (5m31.1s), 000/200 VUs, 6592 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  5m0s
time="2025-07-04T06:01:53Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"